<a href="https://colab.research.google.com/github/nurfnick/Cantrell_Jackson/blob/master/Tracy's%20hot%20mess%20of%20code1.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [0]:
import pandas as pa
import numpy as np
import datetime as dt
import time as tm

# trucks want unique id (id is unique for each truck) want to grab the customer and the date used

In [0]:
urlt = 'https://raw.githubusercontent.com/nurfnick/Cantrell_Jackson/master/trucks.csv'
datframe = pa.read_csv(urlt)
datframe

        id  pri_id  hs_customer  yard  ...  tag color licenseplatenumber  status
0        1     739            1   1.0  ...  NaN   NaN                NaN  active
1        2     740            1   1.0  ...  NaN   NaN                NaN  active
2        3     741            1   1.0  ...  NaN   NaN                NaN  active
3        4       0            2   3.0  ...  NaN   NaN                NaN  active
4        5       0            2   3.0  ...  NaN   NaN                NaN  active
...    ...     ...          ...   ...  ...  ...   ...                ...     ...
3870  3871       0           19  43.0  ...  NaN   NaN                NaN  active
3871  3872       0           19  43.0  ...  NaN   NaN                NaN  active
3872  3873       0           19  43.0  ...  NaN   NaN                NaN  active
3873  3874       0           19  43.0  ...  NaN   NaN                NaN  active
3874  3875       0           19  43.0  ...  NaN   NaN                NaN  active

[3875 rows x 14 columns]

In [0]:
datframetransposed = np.transpose(datframe)
datframetsransposedrowswant = ()
datframestransposedrowswant = datframetransposed[0:1].append(datframetransposed[2:3]).append(datframetransposed[4:5])
datframestransposedrowswant

            0    1    2    3    4    5     ...  3869  3870  3871  3872  3873  3874
id             1    2    3    4    5    6  ...  3870  3871  3872  3873  3874  3875
hs_customer    1    1    1    2    2    2  ...    19    19    19    19    19    19
truck_type     1  107  107  108  108  108  ...     0     0     0     0     0     0

[3 rows x 3875 columns]

In [0]:
datframenew = np.transpose(datframestransposedrowswant)
datframenew

        id hs_customer truck_type
0        1           1          1
1        2           1        107
2        3           1        107
3        4           2        108
4        5           2        108
...    ...         ...        ...
3870  3871          19          0
3871  3872          19          0
3872  3873          19          0
3873  3874          19          0
3874  3875          19          0

[3875 rows x 3 columns]

In [0]:
nandat = pa.DataFrame(datframenew)
datframeu = nandat.dropna()
datframeu

        id hs_customer truck_type
0        1           1          1
1        2           1        107
2        3           1        107
3        4           2        108
4        5           2        108
...    ...         ...        ...
3870  3871          19          0
3871  3872          19          0
3872  3873          19          0
3873  3874          19          0
3874  3875          19          0

[3875 rows x 3 columns]

# tickets based on job details, multiple tickets/ invoice per and mults 'special projects' different categories etc.

In [0]:
url = 'https://raw.githubusercontent.com/nurfnick/Cantrell_Jackson/master/Support-Oct18-Sept19.csv'

In [0]:
df2 = pa.read_csv(url)

#for each unique ticket and invoice, the type and number of job type of each customer.

In [43]:
#16, 18, 19, 5 are too big- zipped files.

# for customer number 4
custnums = [4, 10, 15, 23, 28, 34, 37, 39, 41, 45]
for n in range(len(custnums)):
  print('Customer '+str(custnums[n])+':')
  url = 'https://raw.githubusercontent.com/nurfnick/Cantrell_Jackson/master/hs_customer_'+str(custnums[n])+'.csv'
  df = pa.read_csv(url)
  values = {'invoice_id': 0, 'hs_customer': 0, 'invoice_total': 0, 'invoice_time': 0, 'ticket_id': 0, 'job_type': 0, 'ticket_date': 0,'ticket_item_type': 0, 'details': 0}
  df.fillna(value=values)
  dfnoNAN = df.fillna(value=values)
  dfnoduplicates = dfnoNAN.drop_duplicates()
  dfgroupbbl = dfnoduplicates.groupby('ticket_item_type')
  billbbls = dfgroupbbl.get_group('bill_bbls') 
  billbbls#ticket system is based on bill types so they will have mult overlapping of invoice and ticket ids.
  #count the number of tickets under bbls for job type. still need order based on date
  customerbblssp = ()
  customerbblssp = len(billbbls['job_type'] == 'Special Projects')
  customerbblsfb = ()
  customerbblsfb = len(billbbls['job_type'] == 'Flowback')
  customerbblswh = ()
  customerbblswh = len(billbbls['job_type'] == 'Water Hauling')
  cbblswh = billbbls['job_type'] == 'Water Hauling'
  customerbblstot = customerbblssp + customerbblsfb + customerbblswh
  cbblssp = billbbls['job_type'] == 'Special Projects'
  if cbblssp == True:
    print(sum(cbblssp['invoice_total']))
  cbblsfb = billbbls['job_type'] == 'Flowback'
  cbblswh = billbbls['job_type'] == 'Water Hauling'
  customerbblsspm = ()
  customerbblsspm = sum(cbblssp['invoice_total']).astype(float)
  customerbblswhm = round(sum(cbblswh['invoice_total']),2)
  customerbblstotm = customerbblsspm + customerbblsfbm + customerbblswhm
  print(f'Customer '+str(n)+' Summary: Special Projects Tickets Count: {customerbblssp} Cash: {customerbblsspm}, Water Hauling Ticket Count {customerbblswh} Cash: {customerbblswhm}, Flowback Ticket Count {customerbblsfb} Cash: {customerbblsfbm}, Total Customer Ticket Count {customerbblstot} Cash: {customerbblstotm}')

Customer 4:

ValueError: ignored

In [0]:

# for customer number 4
url2 = 'https://raw.githubusercontent.com/nurfnick/Cantrell_Jackson/master/hs_customer_4.csv'
df3 = pa.read_csv(url2)

In [41]:
cbblssp = cbblssp.astype(float)
cbblssp = billbbls['job_type'] == 'Special Projects'
cbblssp

2882       True
2883       True
2884       True
2885       True
2886       True
          ...
158862    False
158863    False
158864    False
158865    False
158866    False
Name: job_type, Length: 27446, dtype: bool

In [3]:
#turn nan into 0
values = {'invoice_id': 0, 'hs_customer': 0, 'invoice_total': 0, 'invoice_time': 0, 'ticket_id': 0, 'job_type': 0, 'ticket_date': 0,'ticket_item_type': 0, 'details': 0}
df3.fillna(value=values)

        invoice_id  hs_customer  ...  ticket_item_type  details
0           179988            4  ...   job_description   1281.0
1           179987            4  ...   job_description   1281.0
2           179995            4  ...   job_description   1281.0
3           179978            4  ...   job_description   1281.0
4           180011            4  ...   job_description   1281.0
...            ...          ...  ...               ...      ...
187563      223637            4  ...   job_description      0.0
187564      223548            4  ...   job_description      0.0
187565      223544            4  ...   job_description      0.0
187566      223547            4  ...   job_description      0.0
187567      223546            4  ...   job_description      0.0

[187568 rows x 9 columns]

In [5]:
dataframec4 = df3.fillna(value=values)
dataframec4nodupls = dataframec4.drop_duplicates()
titajt = dataframec4nodupls.groupby('ticket_item_type')
billbbls = titajt.get_group('bill_bbls') #ticket system is based on bill types so they will have mult overlapping of invoice and ticket ids.
#count the number of tickets under bbls for job type. still need order based on date
customer4bblssp = ()
customer4bblssp = len(billbbls['job_type'] == 'Special Projects')
customer4bblsfb = ()
customer4bblsfb = len(billbbls['job_type'] == 'Flowback')
customer4bblswh = ()
customer4bblswh = len(billbbls['job_type'] == 'Water Hauling')
customer4bblstot = ()
customer4bblstot = customer4bblssp + customer4bblsfb + customer4bblswh
print(f'Customer 4 ticket summary: Special Projects count {customer4bblssp}, Water Hauling count {customer4bblswh}, Flowback count {customer4bblsfb}, Total ticket count {customer4bblstot}')

Customer 4 ticket summary: Special Projects count 27446, Water Hauling count 27446, Flowback count 27446, Total ticket count 82338

        invoice_id  hs_customer  ...  ticket_item_type  details
2882        179978            4  ...         bill_bbls      0.0
2883        180011            4  ...         bill_bbls      0.0
2884        179978            4  ...         bill_bbls      0.0
2885        179978            4  ...         bill_bbls      0.0
2886        180011            4  ...         bill_bbls      0.0
...            ...          ...  ...               ...      ...
158862      213968            4  ...         bill_bbls    100.0
158863      214057            4  ...         bill_bbls    100.0
158864      213989            4  ...         bill_bbls    100.0
158865      214069            4  ...         bill_bbls    100.0
158866      214060            4  ...         bill_bbls    100.0

[27446 rows x 9 columns]

In [0]:
#count the number of tickets under bbls for job type. still need order based on date
customer4bblssp = ()
customer4bblssp = len(billbbls['job_type'] == 'Special Projects')
customer4bblsfb = ()
customer4bblsfb = len(billbbls['job_type'] == 'Flowback')
customer4bblswh = ()
customer4bblswh = len(billbbls['job_type'] == 'Water Hauling')
customer4bblstot = ()
customer4bblstot = customer4bblssp + customer4bblsfb + customer4bblswh
print(f'Customer 4 ticket summary: Special Projects count {customer4bblssp}, Water Hauling count {customer4bblswh}, Flowback count {customer4bblsfb}, Total ticket count {customer4bblstot}')

Customer 4 ticket summary: Special Projects count 27446, Water Hauling count 27446, Flowback count 27446, Total ticket count 82338

In [0]:
#convert column 'ticket_date' to readable date
ts = tm.gmtime()
readable =[]
for time in billbbls['ticket_date']:
  readable.append(tm.ctime(time))
readable[0:10]

['Thu Sep 27 20:35:01 2018',
 'Mon Oct  1 14:40:12 2018',
 'Mon Oct  1 15:45:47 2018',
 'Mon Oct  1 18:03:34 2018',
 'Mon Oct  1 18:04:41 2018',
 'Mon Oct  1 18:12:34 2018',
 'Mon Oct  1 19:42:52 2018',
 'Mon Oct  1 21:38:51 2018',
 'Tue Oct  2 15:21:11 2018',
 'Tue Oct  2 15:21:59 2018']

In [0]:
billbbls['ticket_date'] = pa.np.where(readable.str.contains("Oct"), "Oct",
                   pa.np.where(readable.str.contains("Sep"), "Sep",
                   pa.np.where(readable.str.contains("Nov"), "Nov")

SyntaxError: ignored

In [0]:
billbbls['ticket_date'] = np.where(billbbls['ticket_date'], readable)

ValueError: ignored

In [0]:
#convert column 'ticket_date' to readable date
ts = tm.gmtime()
readable =[]
for time in billbbls['ticket_date']:
  readable.append(tm.ctime(time))
billbbls['ticket_date'] = readable

TypeError: ignored

In [0]:
dframe = np.unique(dataframec4['ticket_id'])
dframe

array([ 911190,  911761,  914273, ..., 1292099, 1292105, 1292132])

In [0]:
#df3 transposed separate rows we want
df3tl = ()
df3tl = df3t[0:1].append(df3t[2:4]).append(df3t[5:6])
#transpose again
df3tlt = np.transpose(df3tl)
#dataframe with nan values (nanas)
tab4 = pa.DataFrame(df3tlt)
#drop nanas
tab4n = tab4.dropna()
# shows duplicate rows (one instance of each)
duplicateRowsDF = pa.DataFrame(tab4n[tab4n.duplicated()])

duplicateRowsDF

       invoice_id invoice_total invoice_time          job_type
5          179978         15870   1538430035  Special Projects
8          179978         15870   1538430035  Special Projects
9          180011          2170   1538430143  Special Projects
11         180004       6461.22   1538430123  Special Projects
16         180018           460   1538430164  Special Projects
...           ...           ...          ...               ...
187563     223637        5890.5   1547584453     Water Hauling
187564     223548        5446.8   1547582644     Water Hauling
187565     223544          1682   1547582630     Water Hauling
187566     223547        2144.2   1547582641     Water Hauling
187567     223546        2167.5   1547582637     Water Hauling

[181990 rows x 4 columns]

In [0]:
#convert column 'ticket_date' to readable date
ts = tm.gmtime()
readable =[]
for time in df3['ticket_date']:
  readable.append(tm.ctime(time))
readable[0:10]

['Thu Sep 27 18:01:44 2018',
 'Thu Sep 27 19:15:54 2018',
 'Thu Sep 27 20:25:32 2018',
 'Thu Sep 27 20:35:01 2018',
 'Mon Oct  1 14:40:12 2018',
 'Mon Oct  1 15:45:47 2018',
 'Mon Oct  1 15:51:39 2018',
 'Mon Oct  1 15:54:39 2018',
 'Mon Oct  1 18:03:34 2018',
 'Mon Oct  1 18:04:41 2018']

In [0]:
read = 
print(time.strftime("%x %X", ts))

SyntaxError: ignored

In [0]:
#restrict dataframe to only show special projects
spdups = duplicateRowsDF[duplicateRowsDF['job_type'] == 'Special Projects']

In [0]:
#invoice total for job type special projects for customer 4
itspc4 = round(sum(spdups['invoice_total']),2)

In [0]:
whdups = duplicateRowsDF[duplicateRowsDF['job_type'] == 'Water Hauling']

In [0]:
itwhc4 = round(sum(whdups['invoice_total']),2)

In [0]:
fbdups = duplicateRowsDF[duplicateRowsDF['job_type'] == 'Flowback']
itfbc4 = round(sum(fbdups['invoice_total']),2)

In [0]:
itc4 = ()
itc4 = itspc4 + itwhc4 + itfbc4

print(f'Customer 4 spending summary: Special Projects {itspc4}, Water Hauling {itwhc4}, Flowback {itfbc4}, Total {itc4}')

Customer 4 spending summary: Special Projects 13712628.32, Water Hauling 1252045068.74, Flowback 0, Total 1265757697.06

# per truck (unique) and annually- monthly
unix converter time and details, base ticket item for unique trucks

In [0]:
# for customer number 5
url3 = 'https://raw.githubusercontent.com/nurfnick/Cantrell_Jackson/master/hs_customer_5_p1.csv'
df5 = pa.read_csv(url3)
df5

In [0]:
df5t = np.transpose(df5)

In [0]:
df5tl = ()
df5tl = df3t[0:1].append(df5t[2:3]).append(df5t[4:6])

In [0]:
df5tlt = np.transpose(df5tl)

In [0]:
tab5 = pa.DataFrame(df5tlt)
tab5n = tab5.dropna()

In [0]:
duplicateRowsDF = pa.DataFrame(tab5n[tab5n.duplicated()])
print(duplicateRowsDF)

In [0]:
spdups = duplicateRowsDF[duplicateRowsDF['job_type'] == 'Special Projects']
itspc5 = sum(spdups['invoice_total'])

In [0]:
whdups = duplicateRowsDF[duplicateRowsDF['job_type'] == 'Water Hauling']
itwhc5 = sum(whdups['invoice_total'])

In [0]:
fbdups = duplicateRowsDF[duplicateRowsDF['job_type'] == 'Flowback']
itfbc5 = sum(fbdups['invoice_total'])

In [0]:
itc5 = itspc5 + itwhc5 + itfbc5
print(f'Customer 4 spending summary: Special Projects {itspc5}, Water Hauling {itwhc5}, Flowback {itfbc5}, Total {itc5}')

In [0]:
# for customer number 10
url4 = 'https://raw.githubusercontent.com/nurfnick/Cantrell_Jackson/master/hs_customer_10.csv'
df6 = pa.read_csv(url4)
df6

In [0]:
df6t = np.transpose(df6)
df6tl = ()
df6tl = df6t[0:1].append(df6t[2:3]).append(df6t[4:6])
df6tlt = np.transpose(df6tl)

In [0]:
tab6 = pa.DataFrame(df6tlt)
tab6n = tab6.dropna()

In [0]:
duplicateRowsDF = pa.DataFrame(tab6n[tab6n.duplicated()])
print(duplicateRowsDF)

In [0]:
spdups = duplicateRowsDF[duplicateRowsDF['job_type'] == 'Special Projects']
itspc10 = sum(spdups['invoice_total'])

In [0]:
whdups = duplicateRowsDF[duplicateRowsDF['job_type'] == 'Water Hauling']
itwhc10 = sum(whdups['invoice_total'])

In [0]:
fbdups = duplicateRowsDF[duplicateRowsDF['job_type'] == 'Flowback']
itfbc10 = sum(fbdups['invoice_total'])

In [0]:
itc10 = itspc10 + itwhc10 + itfbc10
print(f'Customer 10 spending summary: Special Projects {itspc10}, Water Hauling {itwhc10}, Flowback {itfbc10}, Total {itc10}')

In [0]:
# for customer number 15
url5 = 'https://raw.githubusercontent.com/nurfnick/Cantrell_Jackson/master/hs_customer_15.csv'
df7 = pa.read_csv(url5)

In [0]:
count = df7['ticket_id'].unique,  df7['job_type'] == 'Special Projects'
sum(count[1]*1)

In [0]:
count = df7['ticket_id'].unique,  df7['job_type'] == 'Water Hauling'
sum(count[1]*1)

In [0]:
df7t = np.transpose(df7)
df7tl = ()
df7tl = df7t[0:1].append(df7t[2:3]).append(df7t[4:6])
df7tlt = np.transpose(df7tl)
tab7 = pa.DataFrame(df7tlt)
tab7n = tab7.dropna()
duplicateRowsDF = pa.DataFrame(tab7n[tab7n.duplicated()])
print(duplicateRowsDF)

In [0]:
spdups = duplicateRowsDF[duplicateRowsDF['job_type'] == 'Special Projects']
itspc15 = sum(spdups['invoice_total'])
whdups = duplicateRowsDF[duplicateRowsDF['job_type'] == 'Water Hauling']
itwhc15 = sum(whdups['invoice_total'])
fbdups = duplicateRowsDF[duplicateRowsDF['job_type'] == 'Flowback']
itfbc15 = sum(fbdups['invoice_total'])

In [0]:
itc15 = itspc15 + itwhc15 + itfbc15
print(f'Customer 15 spending summary: Special Projects {itspc15}, Water Hauling {itwhc15}, Flowback {itfbc15}, Total {itc15}')

#customer 15 has more water hauling tickets

In [0]:
# for customer number 23
url6 = 'https://raw.githubusercontent.com/nurfnick/Cantrell_Jackson/master/hs_customer_23.csv'
df8 = pa.read_csv(url6)
df8

In [0]:
count = df8['ticket_id'].unique,  df8['job_type'] == 'Special Projects'
sum(count[1]*1)

In [0]:
df8t = np.transpose(df8)
df8tl = ()
df8tl = df8t[0:1].append(df8t[2:3]).append(df8t[4:6])
df8tlt = np.transpose(df8tl)
tab8 = pa.DataFrame(df8tlt)
tab8n = tab8.dropna()
duplicateRowsDF = pa.DataFrame(tab8n[tab8n.duplicated()])
print(duplicateRowsDF)

In [0]:
spdups = duplicateRowsDF[duplicateRowsDF['job_type'] == 'Special Projects']
itspc23 = sum(spdups['invoice_total'])
whdups = duplicateRowsDF[duplicateRowsDF['job_type'] == 'Water Hauling']
itwhc23 = sum(whdups['invoice_total'])
fbdups = duplicateRowsDF[duplicateRowsDF['job_type'] == 'Flowback']
itfbc23 = sum(fbdups['invoice_total'])

In [0]:
itc23 = itspc23 + itwhc23 + itfbc23
print(f'Customer 15 spending summary: Special Projects {itspc23}, Water Hauling {itwhc23}, Flowback {itfbc23}, Total {itc23}')

#customer 23 has only special projects job type tickets

In [0]:
# for customer number 28
url7 = 'https://raw.githubusercontent.com/nurfnick/Cantrell_Jackson/master/hs_customer_28.csv'
df9 = pa.read_csv(url7)
df9

In [0]:
count = df9['ticket_id'].unique,  df9['job_type'] == 'Special Projects'
sum(count[1]*1)

In [0]:
count = df9['ticket_id'].unique,  df9['job_type'] == 'Water Hauling'
sum(count[1]*1)

In [0]:
df8t = np.transpose(df8)
df8tl = ()
df8tl = df8t[0:1].append(df8t[2:3]).append(df8t[4:6])
df8tlt = np.transpose(df8tl)
tab8 = pa.DataFrame(df8tlt)
tab8n = tab8.dropna()
duplicateRowsDF = pa.DataFrame(tab8n[tab8n.duplicated()])
print(duplicateRowsDF)

In [0]:
spdups = duplicateRowsDF[duplicateRowsDF['job_type'] == 'Special Projects']
itspc28 = sum(spdups['invoice_total'])
whdups = duplicateRowsDF[duplicateRowsDF['job_type'] == 'Water Hauling']
itwhc28 = sum(whdups['invoice_total'])
fbdups = duplicateRowsDF[duplicateRowsDF['job_type'] == 'Flowback']
itfbc28 = sum(fbdups['invoice_total'])

In [0]:
itc28 = itspc28 + itwhc28 + itfbc28
print(f'Customer 28 spending summary: Special Projects {itspc28}, Water Hauling {itwhc28}, Flowback {itfbc28}, Total {itc28}')

#customer 28 has more water hauling job type tickets

In [0]:
# for customer number 34
url8 = 'https://raw.githubusercontent.com/nurfnick/Cantrell_Jackson/master/hs_customer_34.csv'
df10 = pa.read_csv(url8)
df10

In [0]:
count = df10['ticket_id'].unique,  df10['job_type'] == 'Special Projects'
sum(count[1]*1)

In [0]:
count = df10['ticket_id'].unique,  df10['job_type'] == 'Water Hauling'
sum(count[1]*1)

In [0]:
df10t = np.transpose(df10)
df10tl = ()
df10tl = df10t[0:1].append(df10t[2:3]).append(df10t[4:6])
df10tlt = np.transpose(df10tl)
tab10 = pa.DataFrame(df10tlt)
tab10n = tab10.dropna()
duplicateRowsDF = pa.DataFrame(tab10n[tab10n.duplicated()])
print(duplicateRowsDF)

#customer 34 has more water hauling job type tickets

In [0]:
# for customer number 37
url9 = 'https://raw.githubusercontent.com/nurfnick/Cantrell_Jackson/master/hs_customer_37.csv'
df11 = pa.read_csv(url9)
df11

In [0]:
count = df11['ticket_id'].unique,  df11['job_type'] == 'Flowback'
sum(count[1]*1)

In [0]:
count = df11['ticket_id'].unique,  df11['job_type'] == 'Special Projects'
sum(count[1]*1)

In [0]:
count = df11['ticket_id'].unique,  df11['job_type'] == 'Water Hauling'
sum(count[1]*1)

#customer 37 has more flowback job type tickets

In [0]:
# for customer number 39
url10 = 'https://raw.githubusercontent.com/nurfnick/Cantrell_Jackson/master/hs_customer_39.csv'
df12 = pa.read_csv(url10)
df12

In [0]:
count = df12['ticket_id'].unique,  df12['job_type'] == 'Water Hauling'
sum(count[1]*1)

#customer 39 only has water hauling job type tickets

In [0]:
# for customer number 41
url11 = 'https://raw.githubusercontent.com/nurfnick/Cantrell_Jackson/master/hs_customer_41.csv'
df13 = pa.read_csv(url11)
df13

In [0]:
count = df13['ticket_id'].unique,  df13['job_type'] == 'Special Projects'
sum(count[1]*1)

In [0]:
count = df13['ticket_id'].unique,  df13['job_type'] == 'Water Hauling'
sum(count[1]*1)

#customer 41 has more water hauling job type tickets

In [0]:
# for customer number 45
url12 = 'https://raw.githubusercontent.com/nurfnick/Cantrell_Jackson/master/hs_customer_45.csv'
df14 = pa.read_csv(url12)
df14

In [0]:
count = df14['ticket_id'].unique,  df14['job_type'] == 'Special Projects'
sum(count[1]*1)

#customer 45 only has special projects job type tickets

In [0]:
invid = df3['invoice_id'].unique()

In [0]:
invid

In [0]:
cust4spec = df3[df3['job_type']=='Special Projects'], df3['invoice_id'].unique, df3['ticket_id'].unique #job types that are only 'special projects'

In [0]:
cust4spec

In [0]:
uniques = df3['invoice_id'].unique()
data = []

for var in uniques:
  data.append(df3[(df3['ticket_item_type']== "job_description" & df3['invoice_id']== var)])

In [0]:
data

In [0]:
uniques